{
	"title": "Building This Portfolio With Svelte",
	"description": "How I built this entire portfolio site using SvelteKit — from dynamic blogs to smooth routing, and why Svelte just clicks.",
	"fullContent": "<h2>So I Needed a Portfolio</h2><p>Every developer hits that point where they need an actual portfolio site. Not just a GitHub profile or a LinkedIn page — something that actually feels like yours.</p><p>I wanted something clean, fast, and not a nightmare to maintain.</p><p>That's where Svelte came in.</p><h2>Why Svelte Over React or Vue?</h2><p>I've worked with React before. It's solid. But honestly? The boilerplate gets exhausting.</p><p>Svelte just... makes sense. Less code. No virtual DOM overhead. Actual reactivity without weird hooks.</p><p>Plus, SvelteKit handles routing, SSR, and all the framework stuff without feeling like you're configuring webpack for three hours.</p><h2>The Structure: Keeping It Simple</h2><p>The site is split into sections:</p><ul><li>Main landing section</li><li>About me</li><li>Skills</li><li>Timeline (work & education)</li><li>Projects showcase</li><li>Blog (yeah, the one you're reading right now)</li><li>Contact</li></ul><p>Each section lives in its own component. No monolithic files. Just clean separation.</p><p>SvelteKit's file-based routing makes this stupid easy. Want a <code>/blogs</code> page? Just create <code>src/routes/blogs/+page.svelte</code>. Done.</p><h2>Dynamic Blogs Using JSON</h2><p>Originally, I hardcoded blog data into the page. Bad idea.</p><p>Then I moved everything into JSON files inside <code>static/blogs/</code>. Now the blog page dynamically loads all JSON files at runtime.</p><p>Add a new blog? Just drop a JSON file in that folder. No need to touch the code.</p><pre><code>const blogFiles = import.meta.glob('/static/blogs/*.json');\nconst blogPromises = Object.entries(blogFiles).map(async ([path, resolver]) => {\n  const response = await fetch(path.replace('/static', ''));\n  return await response.json();\n});\nblogs = await Promise.all(blogPromises);</code></pre><p>Simple. Works. Scales.</p><h2>Component Structure That Actually Makes Sense</h2><p>Everything lives under <code>src/lib/</code>:</p><ul><li><code>components/blog/</code> — blog cards and layouts</li><li><code>components/layout/</code> — navbar, footer</li><li><code>components/project/</code> — project cards</li><li><code>sections/</code> — major page sections</li></ul><p>Svelte's scoped styles mean I don't need CSS modules or some convoluted naming system. Styles stay where they belong — in the component.</p><h2>What I Actually Like About Svelte</h2><p>Reactivity just works. No <code>useState</code>, no <code>useEffect</code>. Just:</p><pre><code>let count = 0;\n$: doubled = count * 2;</code></pre><p>That's it. <code>doubled</code> updates automatically when <code>count</code> changes.</p><p>No mental gymnastics. No dependency arrays. Just logic.</p><h2>Deployment? Ridiculously Easy</h2><p>SvelteKit builds everything into static files. Host it anywhere — Vercel, Netlify, GitHub Pages, wherever.</p><p>No server required. Just pure static HTML, CSS, and JS.</p><p>Fast. Simple. Works everywhere.</p><h2>What I'd Do Differently Next Time</h2><p>Honestly? Not much.</p><p>Maybe use a headless CMS instead of JSON files if the blog scales. But for now, JSON works perfectly fine.</p><p>I might also add transitions between pages. SvelteKit supports that natively, I just haven't gotten around to it yet.</p><h2>Final Thoughts</h2><p>Building this site with Svelte was genuinely enjoyable.</p><p>No framework fatigue. No config hell. Just clean code that does what it's supposed to do.</p><p>If you're building something similar — a portfolio, a blog, whatever — give Svelte a shot.</p><p>You might actually have fun doing it.</p>",
	"imageUrl": "/images/Frame 3.png",
	"tags": ["Svelte", "Web Development", "Portfolio", "SvelteKit"],
	"date": "Jan 2, 2026",
	"readTime": "6 min read"
}
