{
  "title": "Why I Chose the Name 'lost'",
  "description": "A short reflection on getting distracted, getting absorbed, and finding an identity in the word 'lost'.",
  "fullContent": "<h2>I Get Lost. A Lot.</h2><p>I get distracted really easily.</p><p>Sometimes I'm lost in the real world — zoning out, missing what's happening around me. Other times, I'm lost in my own work, deep into something that may or may not even be useful in the end.</p><p>But I've realized something over time.</p><p>Being lost isn't always a bad thing.</p><h2>Lost in Thought, Lost in Work</h2><p>When I'm working on something I enjoy, I disappear into it. Time passes without me noticing. I jump between ideas, experiments, and random rabbit holes.</p><p>Not all of it leads somewhere meaningful.</p><p>But some of my best learning moments came from being lost — not following a plan, just curiosity pulling me forward.</p><h2>LostLuinor Energy</h2><p>One of my favorite Beyblades growing up was LostLuinor.</p><p>It wasn't just about power. It had attitude. Chaos. Spin-steal. It survived by adapting.</p><p>That name stuck with me.</p><p>There was something cool about embracing the word “lost” instead of running from it.</p><h2>A Hacker Name, A Gaming Alias</h2><p>“lost” also just works.</p><p>It sounds clean. Minimal. A little mysterious.</p><p>As a hacker-style name, it fits — someone who doesn't follow straight paths, who explores systems, breaks things, figures stuff out the long way.</p><p>As a gaming alias, it feels right too. Simple, memorable, and not trying too hard.</p><h2>Not Lost — Just Exploring</h2><p>I don't think being lost means being clueless.</p><p>Sometimes it just means you're exploring without a map.</p><p>That's how I learn. That's how I build. That's how I end up discovering things I wouldn't have found otherwise.</p><p>So yeah — I chose the name “lost”.</p><p>Not because I don't know where I'm going.</p><p>But because I'm okay taking the long way there.</p>",
  "imageUrl": "/images/LostLogo.png",
  "tags": ["Personal", "Gaming", "Identity", "lost"],
  "date": "Dec 13, 2024",
  "readTime": "4 min read"
}
